Change Architecture diagram to PlantUML
